In [1]:
# set up 

import pandas as pd
import numpy as np

#### Check in exercises 

1.) The integer number -999 is often used to represent missing values. Create a pandas.Series named s with four integer values, two of which are -999. The index of this series should be the the letters A through D.

In [2]:
s = pd.Series([4, -999, 8, -999], index=['A', 'B', 'C', 'D'])
print(s)

A      4
B   -999
C      8
D   -999
dtype: int64

2.) In the pandas.Series documentation, look for the method mask(). Use this method to update the series s so that the -999 values are replaced by NA values. HINT: check the first example in the method’s documentation.

In [6]:
result = s.mask(s < 0)
print(result)

A    4.0
B    NaN
C    8.0
D    NaN
dtype: float64

In [8]:
#another way to do it 

result2 = s.mask(s == -999)
print(result2)

A    4.0
B    NaN
C    8.0
D    NaN
dtype: float64

3.) We can access the data frame’s column names via the columns attribute. Update the column names to C1 and C2 by updating this attribute.

In [4]:
# From the notes 
# Initialize dictionary with columns' data 
d = {'col_name_1' : pd.Series(np.arange(3)),
     'col_name_2' : pd.Series([3.1, 3.2, 3.3]),
     }

# Create data frame
df = pd.DataFrame(d)

# Change index
df.index = ['a','b','c']
df

   col_name_1  col_name_2
a           0         3.1
b           1         3.2
c           2         3.3

In [5]:
# updating column names 
df.columns = ['C1', 'C1']
df

   C1   C1
a   0  3.1
b   1  3.2
c   2  3.3